wpond/Orient-TDMA/efm32usb/src/efm32_usbh.c
  @n @subsection usb_device_connection Device connection

    This framework can be used to establish a device connection.
    @verbatim

// Initialize USB host stack
USBH_Init( &is );

for (;;)
{
  // Wait for ever on device attachment

  // The second parameter is timeout in seconds, 0 means for ever
  if ( USBH_WaitForDeviceConnectionB( tmpBuf, 0 ) == USB_STATUS_OK )
  {

    // Device is now connected and ready for enumeration !

  }

  // Wait for disconnection
  while ( USBH_DeviceConnected() ){}

  // Disable USB peripheral, power down USB port.
  USBH_Stop();
}@endverbatim

  @n @subsection usb_device_enumeration Device enumeration and configuration

    This framework can be used to enumerate and activate the device.
    @verbatim

  // Enumerate device, retrieve device and configuration descriptors from device
  USBH_QueryDeviceB( tmpBuf, sizeof( tmpBuf ), USBH_GetPortSpeed() );

  // Qualify the device
  if ( ( USBH_QGetDeviceDescriptor( tmpBuf )->idVendor  == 0x2544               ) &&
       ( USBH_QGetDeviceDescriptor( tmpBuf )->idProduct == 0x0001               ) &&
       ( USBH_QGetDeviceDescriptor( tmpBuf )->bNumConfigurations == 1           ) &&
       ( USBH_QGetConfigurationDescriptor( tmpBuf, 0 )->bNumInterfaces  == 1    ) &&
       ( USBH_QGetInterfaceDescriptor(  tmpBuf, 0, 0 )->bInterfaceClass == 0xFF ) &&
       ( USBH_QGetInterfaceDescriptor(  tmpBuf, 0, 0 )->bNumEndpoints   == 2    )    )
  {
    // After having determined that the device is "our" device, it's time to
    // give it an USB address and activate the configuration.

    // Populate device and endpoint data structures with
    // data retrieved during enumeration.
    USBH_InitDeviceData( &device, tmpBuf, ep, 2, USBH_GetPortSpeed() );

    USBH_SetAddressB( &device, DEV_ADDR );
    USBH_SetConfigurationB( &device, device.confDesc.bConfigurationValue );

    // Assign host channels to device endpoints
    USBH_AssignHostChannel( &ep[ 0 ], 2 );
    USBH_AssignHostChannel( &ep[ 1 ], 3 );

    // We are now ready to use the device !

  }@endverbatim

@n @section usb_host_api The host stack API

  @li @ref usb_host_apiintro
  @li @ref usb_host_init
  @li @ref usb_host_transfer
  @li @ref usb_host_ch9
  @li @ref usb_host_port
  @li @ref usb_host_enum
  @li @ref usb_host_print

  @n @subsection usb_host_apiintro Introduction
    This section contains brief descriptions of all functions in the API. You will
    find detailed information on input and output parameters and return values by
    clicking on the hyperlinked function names. It is also a good idea to study
    the code in the USB demonstration projects.

    Your application code must include one header file: @em efm32_usb.h.

    The functions in the API come in two flavours, they are either blocking or
    non-blocking. The blocking functions have an uppercase letter B at the end
    of the function name. Blocking functions can not be called when interrupts
    are disabled. Note that all API callback functions are called from within
    the USB peripheral interrupt handler with interrupts disabled.

    The USB stack use TIMER0 to keep track of time. Your application must not use
    this timer.

    <b>Pitfalls:</b>@n
      An USB peripheral will fill host receive buffers in quantities of WORD's
      (4 bytes). When allocating storage for receive buffers, round size up to
      next WORD boundary. If it is possible that a device will send more data
      than host expects, round buffer size up to the next multiple of
      maxpacket size for the relevant endpoint to avoid buffer overflow. @n
      Transmit and receive buffers must also be WORD aligned. Macros are available
      for allocating buffers, see @ref UBUF and @ref STATIC_UBUF.

      Transmit buffers passed to non-blocking transfer functions must be
      statically allocated because these functions do not have their own buffers.
      The data in the transmit buffers must be valid until the transfer completes,
      times out or fails.

      To handle USB strings correctly, the UTF-16LE wide characterset is used.
      On gcc use flags -fwide-exec-charset=UTF-16LE -fshort-wchar for the compiler,
      and -Wl,--no-wchar-size-warning for the linker.

  @n @subsection usb_host_init Top level control functions
    @ref USBH_Init() @n
      Initial host stack initialization, call once in start of main().

    @ref USBH_Stop() @n
      Terminates host operation, turns off VBUS.

    @ref USBH_WaitForDeviceConnectionB() @n
      Wait for device connection with optional timeout.

    @ref USBH_AssignHostChannel() @n
      Associate a device endpoint with a host channel.

  @n @subsection usb_host_transfer USB transfer functions
    @ref USBH_ControlMsg(), @ref USBH_ControlMsgB() @n
      Perform a non-blocking or blocking USB control message transfer.

    @ref USBH_Read(), @ref USBH_ReadB() @n
      Perform a non-blocking or blocking USB IN data transfer. Data direction is
      @em from device @em to host.

    @ref USBH_Write(), @ref USBH_WriteB() @n
      Perform a non-blocking or blocking USB OUT data transfer. Data direction is
      @em from host @em to device.

  @n @subsection usb_host_ch9 USB Chapter 9 support functions
    All Chapter 9 support functions are blocking with a timeout of 1 second.

    @ref USBH_GetConfigurationDescriptorB() @n
      Read a configuration descriptor from a device.

    @ref USBH_GetDeviceDescriptorB() @n
      Read a device descriptor from a device.

    @ref USBH_GetStringB() @n
      Read a string descriptor from a device.

    @ref USBH_SetAddressB() @n
      Set new USB device address on device currently on USB address 0.

    @ref USBH_SetAltInterfaceB() @n
      Set alternate interface on a device.

    @ref USBH_SetConfigurationB() @n
      Set device configuration.

    @ref USBH_StallEpB(), @ref USBH_UnStallEpB() @n
      These functions stalls or un-stalls an endpoint. Uses USB standard
      requests SET_FEATURE and CLEAR_FEATURE.

  @n @subsection usb_host_port Host port control functions

    @ref USBH_DeviceConnected() @n
      Check if a device is connected on the USB host port.

    @ref USBH_GetPortSpeed() @n
      Get the bus speed (low speed or full speed) of the device currently
      connected to the USB host port.

    @ref USBH_PortResume() @n
      Drive resume signalling on the USB host port.

    @ref USBH_PortSuspend() @n
      Set the USB host port in suspend mode.

  @n @subsection usb_host_enum Enumeration and query functions
      @ref USBH_QueryDeviceB() @n
        This function will read the device and configuration descriptors
        from a device at USB address 0. The application must allocate a buffer
        of sufficent size to hold the data. This data buffer can later be
        used by all USBH_Q<em>xxx</em> functions to retrieve pointers to
        any descriptor within any configuration descriptor. Data retrieved
        by this function must also be passed to @htmlonly USBH_InitDeviceData()
        @endhtmlonly before normal device communication can start.
        Ref. section @ref usb_device_enumeration.

      @ref USBH_QGetConfigurationDescriptor() @n
        Get a pointer to a given configuration descriptor. Parses through a
        data buffer which must have been previously populated by a call to
        @htmlonly USBH_QueryDeviceB() @endhtmlonly.

      @ref USBH_QGetDeviceDescriptor() @n
        Get a pointer to the device descriptor. Parses through a data buffer
        which must have been previously populated by a call to @htmlonly
        USBH_QueryDeviceB() @endhtmlonly.

      @ref USBH_QGetEndpointDescriptor() @n
        Get a pointer to a given endpoint descriptor within a given interface
        within a given configuration. Parses through a data buffer which must
        have been previously populated by a call to @htmlonly USBH_QueryDeviceB().
        @endhtmlonly

      @ref USBH_QGetInterfaceDescriptor() @n
        Get a pointer to an interface descriptor within a given configuration.
        Parses through a data buffer which must have been previously populated
        by a call to @htmlonly USBH_QueryDeviceB() @endhtmlonly.

