wpond/Orient-TDMA/efm32usb/src/efm32_usbh.c
      @ref USBH_InitDeviceData() @n
        Populates device and endpoint data structures with data which must
        have been retrieved from a device by a call to
        @htmlonly USBH_QueryDeviceB() @endhtmlonly.
        The application must allocate and provide device and endpoint data
        structures to the host stack.
        After this function is called the device and endpoint data structures
        can be used as parameters (@em handles) to other API functions as needed.

  @n @subsection usb_host_print Utility functions

      @ref USBH_PrintString() @n
        Print an USB string descriptor on the debug serial port with optional leader
        and trailer strings.

      @ref USBH_PrintConfigurationDescriptor(),
      @ref USBH_PrintDeviceDescriptor(),
      @ref USBH_PrintEndpointDescriptor(),
      @ref USBH_PrintInterfaceDescriptor() @n
        Pretty print descriptors on the debug serial port.

      USB_PUTCHAR() @n Transmit a single char on the debug serial port.

      USB_PUTS() @n Transmit a zero terminated string on the debug serial port.

      USB_PRINTF() @n Transmit "printf" formated data on the debug serial port.

      USB_GetErrorMsgString() @n Return an error message string for a given
      error code.

      USB_PrintErrorMsgString() @n Format and print a text string given an
      error code, prepends an optional user supplied leader string.

      USBTIMER_DelayMs() @n Active wait millisecond delay function. Can also be
      used inside interrupt handlers.

      USBTIMER_DelayUs() @n Active wait microsecond delay function. Can also be
      used inside interrupt handlers.

      USBTIMER_Init() @n Initialize the timer system. Called by @htmlonly
      USBH_Init(), @endhtmlonly but your application must call it again to
      reinitialize whenever you change the HFPERCLK frequency.

      USBTIMER_Start() @n Start a timer. You can configure the USB device stack
      to provide any number of timers. The timers have 1 ms resolution, your
      application is notified of timeout by means of a callback.

      USBTIMER_Stop() @n Stop a timer.

@n @section usb_host_conf Configuring the host stack

  Your application must provide a header file named @em usbconfig.h. This file
  must contain the following \#define's:@n @n
  @verbatim
#define USB_HOST         // Compile the stack for host mode.
#define NUM_HC_USED n    // Your application use 'n' host channels in addition
                         // to channels 0 and 1 which are assigned by the
                         // host stack for device endpoint 0 communication. @endverbatim

  @n @em usbconfig.h may define the following items: @n @n
  @verbatim
#define NUM_APP_TIMERS n // Your application needs 'n' timers

#define DEBUG_USB_API    // Turn on API debug diagnostics.

// Some utility functions in the API needs printf. These
// functions have "print" in their name. This macro enables
// these functions.
#define USB_USE_PRINTF   // Enable utility print functions.

// Define a function for transmitting a single char on the serial port.
extern int RETARGET_WriteChar(char c);
#define USER_PUTCHAR  RETARGET_WriteChar @endverbatim

  @n You are strongly encouraged to start application development with DEBUG_USB_API
  turned on. When DEBUG_USB_API is turned on and USER_PUTCHAR is defined, useful
  debugging information will be output on the development kit serial port.
  Compiling with the DEBUG_EFM_USER flag will also enable all asserts
  in both @em efm32lib and in the USB stack. If asserts are enabled and
  USER_PUTCHAR defined, assert texts will be output on the serial port.

  You application must include @em retargetserial.c if DEBUG_USB_API is defined
  and @em retargetio.c if USB_USE_PRINTF is defined.
  These files reside in the @em drivers
  directory in the software package for your development board.

 * @}**************************************************************************/

#endif /* defined( USB_HOST ) */
#endif /* defined( USB_PRESENT ) && ( USB_COUNT == 1 ) */
